IDEA StatiCa Open Model
StrainImpulse.PhiX Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 The torsion slope around x axis.
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double PhiX { get; set; }
Public Property PhiX As Double
	Get
	Set
public:
property double PhiX {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
StrainImpulse Structure
IdeaRS.OpenModel.Loading Namespace